name: "swin_classifier"
backend: "onnxruntime"
max_batch_size: 32
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, 224, 224]
  }
]
output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [1000]
  }
]
instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
optimization {
  execution_accelerators {
    gpu_execution_accelerator : [ { name : "tensorrt" } ]
  }
}
